jcfain/TCodeESP32/ESP32/src/SettingsHandler.h
/* MIT License

Copyright (c) 2024 Jason C. Fain

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE. */

#pragma once

#include <sstream>
#include <WiFi.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <vector>
#include <map>
#include <Wire.h>
// // #include "LogHandler.h"
#include "utils.h"
#include "TagHandler.h"
#include "struct/voice.h"
#include "struct/motionProfile.h"
#include "struct/channel.h"
#include "struct/motionChannel.h"
#include "struct/buttonSet.h"
#include "enum.h"
#include "constants.h"
#include "channelMap.hpp"
#include "settingConstants.h"
#include "settingsFactory.h"

#define DESERIALIZE_SIZE 32768
#define SERIALIZE_SIZE 24576

//using SETTING_STATE_FUNCTION_PTR_T = void (*)(const char *group, const char *settingNameThatChanged);

class SettingsHandler
{
public:
    static bool initialized;
    static int restartRequired;
    static bool saving;
    static bool motionPaused;
    static bool fullBuild;
    static LogLevel logLevel;
    static std::vector<int> systemI2CAddresses;

    static ChannelMap channelMap;
    static std::vector<Channel> currentChannels;
    static BuildFeature buildFeatures[(int)BuildFeature::MAX_FEATURES];
    
    // static TCodeVersion TCodeVersionEnum;
    // static MotorType motorType;
    // static const char defaultIP[15];
    // static const char defaultGateWay[15];
    // static const char defaultSubnet[15];
    // const static char HandShakeChannel[4];
    // const static char SettingsChannel[4];
    // static bool bluetoothEnabled;
    // static bool isTcp;
    // static char ssid[32];
    // static char wifiPass[63];
    // static int udpServerPort;
    // static int webServerPort;
    // static char hostname[63];
    // static char friendlyName[100];
    // static int TwistFeedBack_PIN; // Vibe 4?
    // static int RightServo_PIN;
    // static int LeftServo_PIN;
    // static int RightUpperServo_PIN;
    // static int LeftUpperServo_PIN;
    // static int PitchLeftServo_PIN;
    // static int PitchRightServo_PIN;
    // static int ValveServo_PIN;
    // static int TwistServo_PIN;

    // static bool BLDC_UsePWM;
    // static bool BLDC_UseMT6701;
    // static bool BLDC_UseHallSensor;
    // static int BLDC_Pulley_Circumference;
    // static int BLDC_Encoder_PIN;
    // static int BLDC_HallEffect_PIN;
    // static int BLDC_ChipSelect_PIN; 
    // static int BLDC_Enable_PIN;
    // static int BLDC_PWMchannel1_PIN;
    // static int BLDC_PWMchannel2_PIN;
    // static int BLDC_PWMchannel3_PIN;
    // static float BLDC_MotorA_Voltage;
    // static float BLDC_MotorA_Current; 
    // static bool BLDC_MotorA_ParametersKnown;
    // static float BLDC_MotorA_ZeroElecAngle;
    // static int BLDC_RailLength;
    // static int BLDC_StrokeLength;

    // static int Vibe0_PIN;
    // static int Vibe1_PIN;
    // static int Vibe2_PIN;
    // static int Vibe3_PIN;
    // static int LubeButton_PIN;
    // static int Squeeze_PIN;
    // static int msPerRad;
    // static int servoFrequency;
    // static int pitchFrequency;
    // static int valveFrequency;
    // static int twistFrequency;
    // static int squeezeFrequency;
    // static bool pitchFrequencyIsDifferent;
    // static bool feedbackTwist;
    // static bool continuousTwist;
    // static bool analogTwist;
    // static bool staticIP;
    static char currentIP[IP_ADDRESS_LEN];
    static char currentGateway[IP_ADDRESS_LEN];
    static char currentSubnet[IP_ADDRESS_LEN];
    static char currentDns1[IP_ADDRESS_LEN];
    static char currentDns2[IP_ADDRESS_LEN];
    // static bool sr6Mode;
    // static DeviceType deviceType;
    // static int RightServo_ZERO;
    // static int LeftServo_ZERO;
    // static int RightUpperServo_ZERO;
    // static int LeftUpperServo_ZERO;
    // static int PitchLeftServo_ZERO;
    // static int PitchRightServo_ZERO;
    // static int TwistServo_ZERO;
    // static int ValveServo_ZERO;
    // static int SqueezeServo_ZERO;
    // static bool autoValve;
    // static bool inverseValve;
    // static bool inverseStroke;
    // static bool inversePitch;
    // static bool valveServo90Degrees;
    // static bool lubeEnabled;
    // static int lubeAmount;
    // static bool displayEnabled;
    // static bool sleeveTempDisplayed;
    // static bool internalTempDisplayed;
    // static bool versionDisplayed;
    // static bool tempSleeveEnabled;
    // static bool tempInternalEnabled;
    // static bool fanControlEnabled;
    // static bool batteryLevelEnabled;

    // //static int Battery_Voltage_PIN;

    // static bool batteryLevelNumeric;
    // static double batteryVoltageMax;
    // static int batteryCapacityMax;
    // static int Display_Screen_Width;
    // static int Display_Screen_Height;
    // static int Internal_Temp_PIN;
    // static int Case_Fan_PIN;
    // static int Sleeve_Temp_PIN;
    // static int caseFanMaxDuty;
    // static double internalTempForFan; // C
    // static double internalMaxTemp;    // C
    // static int Heater_PIN;
    // //static int HeatLED_PIN;
    // static int I2C_SDA_PIN_obsolete;
    // static int I2C_SCL_PIN_obsolete;
    // static int TargetTemp; // Desired Temp in degC
    // static int HeatPWM;    // Heating PWM setting 0-255
    // static int HoldPWM;    // Hold heat PWM setting 0-255
    // static int Display_I2C_Address;
    // static int Display_Rst_PIN;
    // // static long heaterFailsafeTime;
    // static float heaterThreshold;
    // static int heaterResolution;
    // static int heaterFrequency;
    // static int caseFanFrequency;
    // static int caseFanResolution;

    // static bool bootButtonEnabled;
    // static bool buttonSetsEnabled;
    // static char bootButtonCommand[MAX_COMMAND];
    static ButtonSet buttonSets[MAX_BUTTON_SETS];
    // static uint8_t defaultButtonSetPin;
    // static uint16_t buttonAnalogDebounce;

    // static VoiceCommand voiceCommands[147];

    // static const char *lastRebootReason;

