jcfain/TCodeESP32/ESP32/src/SettingsHandler.h
    // static const char *userSettingsFilePath;
    // static const char *wifiPassFilePath;
    // static const char *buttonsFilePath;
    // static const char *motionProfilesFilePath;
    // static const char *logPath;
    // static const char *defaultWifiPass;
    // static const char *decoyPass;
    static bool apMode;

    
    // template<typename T,
    //          typename = std::enable_if<!std::is_const<T>::value || std::is_integral<T>::value || std::is_enum<T>::value || std::is_floating_point<T>::value || std::is_same<T, bool>::value>>
    // static void getValue(const char* name, T &value)
    // {
    //     m_settingsFactory->getValue(name, value);
    // }
    
    // static void getValue(const char* name, char* value, size_t len)
    // {
    //     m_settingsFactory->getValue(name, value, len);
    // }

    // static void defaultValue(const char* name) 
    // {
    //     m_settingsFactory->defaultValue(name);
    // }

    static void init()
    {
        setBuildFeatures();
        setMotorType();

        // loadWifiInfo(false);
        // loadSettings(false);
        loadMotionProfiles(false);
        loadButtons(false);

        LogHandler::debug(_TAG, "Last reset reason: %s", machine_reset_cause());
        initialized = true;
    }

    static void setMessageCallback(SETTING_STATE_FUNCTION_PTR_T f)
    {
        LogHandler::debug(_TAG, "setMessageCallback");
        if (f == nullptr)
        {
            message_callback = 0;
        }
        else
        {
            message_callback = f;
        }
    }

    // static bool isBoardType(BoardType value) {
    //     return m_settingsFactory->getBoardType() == value;
    // }

    static void printFree(bool forcePrint = false) {
        if(forcePrint || LogHandler::getLogLevel() == LogLevel::DEBUG)
        {
            uint32_t freeHEap = ESP.getFreeHeap();
            uint32_t heapSize = ESP.getHeapSize();
            //https://esp32.com/viewtopic.php?t=27780
            //https://github.com/espressif/esp-idf/blob/master/components/heap/include/esp_heap_caps.h#L20-L37
            //esp_get_free_internal_heap_size
            Serial.printf("Used heap INTERNAL: %u/%u Free: %u\n", heapSize - freeHEap, heapSize, freeHEap);
            Serial.printf("Free psram: %u\n", ESP.getFreePsram());
            Serial.printf("Total Psram: %u\n", ESP.getPsramSize());
            Serial.printf("LittleFS used: %i\n", LittleFS.usedBytes());
            Serial.printf("LittleFS total: %i\n", LittleFS.totalBytes());
            //LogHandler::debug(_TAG, "Used Psram: %u/%u", ESP.getPsramSize() - ESP.getFreePsram(), ESP.getPsramSize());
            Serial.printf("Sketch size: %u\n", ESP.getSketchSize());
            Serial.printf("Sketch free space: %u\n", ESP.getFreeSketchSpace());
            Serial.printf("DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));
            Serial.printf("IRAM %u\n", heap_caps_get_free_size(MALLOC_CAP_32BIT));
            Serial.printf("FREE_HEAP Default %u\n", esp_get_free_heap_size());
            Serial.printf("MIN_FREE_HEAP %u\n", esp_get_minimum_free_heap_size() );
            //uxTaskGetStackHighWaterMark
        }
    }

	static void restart(const int delayInSec = 0) {
		LogHandler::info(_TAG, "Schedule device restart in %ld seconds", delayInSec);
        // Restart in main task loop
		restartRequired = delayInSec;
	}

    static void printWebAddress(const char* hostAddress) 
    {
        char webServerportString[6];
        int webServerPort = 0;
        m_settingsFactory->getValue(WEBSERVER_PORT, webServerPort);
        sprintf(webServerportString, ":%d", webServerPort);
        LogHandler::info(_TAG, "Web address: http://%s%s", hostAddress, webServerPort == 80 ? "" : webServerportString);
    }
    
    static bool saveAll(JsonObject obj = JsonObject()) 
    {
        if(!m_settingsFactory->saveAllToDisk(obj) || !saveMotionProfiles(obj) || !saveButtons(obj))
            return false;
        return true;
    }
    
    static bool saveAll(const String& data)
    {
        LogHandler::debug(_TAG, "Save frome string");
        printFree();
        JsonDocument doc;
    
        DeserializationError error = deserializeJson(doc, data);
        if (error)
        {
            LogHandler::error(_TAG, "Settings save: Deserialize error: %s", error.c_str());
            return false;
        }
        printFree();
        JsonObject obj = doc.as<JsonObject>();
        if (!saveAll(obj))
        {
            LogHandler::error(_TAG, "Settings save: save error");
            return false;
        }
        return true;
    }

    static bool defaultPinout() {
		//setBoardPinout();
        if(!m_settingsFactory->resetPins())
            return false;
        const PinMap* pinMap = m_settingsFactory->getPins();
        for(int i = 0; i < MAX_BUTTON_SETS; i++) {
            buttonSets[i].pin = pinMap->buttonSetPin(i);
        }
        return m_settingsFactory->savePins();
    }

    static void getWifiInfo(char* buf)
    {
        JsonDocument doc; //100

        JsonDocument wifiDoc = m_settingsFactory->getNetworkSettings();

        doc.set(wifiDoc);
        const char* wifiPass = doc[WIFI_PASS_SETTING];
        if(strcmp(wifiPass, WIFI_PASS_DONOTCHANGE_DEFAULT)) {
            doc[WIFI_PASS_SETTING] = DECOY_PASS; // Never set to actual password
        } else {
            doc[WIFI_PASS_SETTING] = WIFI_PASS_DONOTCHANGE_DEFAULT;
        }

        String output;
        serializeJson(doc, output);
        doc.clear();
        if (LogHandler::getLogLevel() == LogLevel::VERBOSE)
            Serial.printf("Network Info: %s\n", output.c_str());
        buf[0] = {0};
        strcpy(buf, output.c_str());
    }

    static void getSystemInfo(String &buf)
    {
        JsonDocument doc; // 3500

        doc["esp32Version"] = FIRMWARE_VERSION_NAME;
        doc["TCodeVersion"] = m_settingsFactory->getTcodeVersion();
        doc["lastRebootReason"] = machine_reset_cause();

        JsonArray logLevels = doc["logLevels"].to<JsonArray>();
        JsonObject logLevelNone = logLevels.add<JsonObject>();
        logLevelNone["name"] = "None";
        logLevelNone["value"] = LogLevel::NONE;
        JsonObject logLevelError= logLevels.add<JsonObject>();
        logLevelError["name"] = "Error";
        logLevelError["value"] = LogLevel::ERROR;
        JsonObject logLevelWarning = logLevels.add<JsonObject>();
        logLevelWarning["name"] = "Warning";
        logLevelWarning["value"] = LogLevel::WARNING;
        JsonObject logLevelInfo = logLevels.add<JsonObject>();
        logLevelInfo["name"] = "info";
        logLevelInfo["value"] = LogLevel::INFO;
        JsonObject logLevelDebug = logLevels.add<JsonObject>();
        logLevelDebug["name"] = "Debug";
        logLevelDebug["value"] = LogLevel::DEBUG;
        JsonObject logLevelVerbose = logLevels.add<JsonObject>();
        logLevelVerbose["name"] = "Verbose";
        logLevelVerbose["value"] = LogLevel::VERBOSE;
        
        JsonArray tcodeVersions = doc["tcodeVersions"].to<JsonArray>();
        JsonObject v03 = tcodeVersions.add<JsonObject>();
        v03["name"] = "v0.3";
        v03["value"] = TCodeVersion::v0_3;
        JsonObject v04 = tcodeVersions.add<JsonObject>();
        v04["name"] = "v0.4 (Experimental)";
        v04["value"] = TCodeVersion::v0_4;
        JsonArray boardTypes = doc["boardTypes"].to<JsonArray>();
#if CONFIG_IDF_TARGET_ESP32
        JsonObject devkit = boardTypes.add<JsonObject>();
        devkit["name"] = "Devkit/NexusPRO";
        devkit["value"] = (uint8_t)BoardType::DEVKIT;
        JsonObject SR6MB = boardTypes.add<JsonObject>();
        SR6MB["name"] = "SR6MB";
        SR6MB["value"] = (uint8_t)BoardType::CRIMZZON;
        JsonObject INControl = boardTypes.add<JsonObject>();
        INControl["name"] = "IN-Control";
        INControl["value"] = (uint8_t)BoardType::ISAAC;
#elif CONFIG_IDF_TARGET_ESP32S3
    #ifdef S3_ZERO
        JsonObject S3_Zero = boardTypes.add<JsonObject>();
        S3_Zero["name"] = "S3 Zero";
        S3_Zero["value"] = (uint8_t)BoardType::ZERO;
    #else
        JsonObject N8R8 = boardTypes.add<JsonObject>();
        N8R8["name"] = "S3 N8R8";
        N8R8["value"] = (uint8_t)BoardType::N8R8;
    #endif
#endif
        int motorType = MOTOR_TYPE_DEFAULT;
        m_settingsFactory->getValue(MOTOR_TYPE_SETTING, motorType);
        doc["motorType"] = motorType;
        JsonArray buildFeaturesJsonArray = doc["buildFeatures"].to<JsonArray>();
        for (BuildFeature value : buildFeatures)
        {
            buildFeaturesJsonArray.add((int)value);
        }
        doc["moduleType"] = (int)MODULE_CURRENT;

        JsonArray availableTagsJsonArray = doc["availableTags"].to<JsonArray>();
        for (const char *tag : TagHandler::AvailableTags)
        {
            availableTagsJsonArray.add(tag);
        }
        JsonArray systemI2CAddressesJsonArray = doc["systemI2CAddresses"].to<JsonArray>();
        systemI2CAddressesJsonArray.add("0x0");
        for (int value : systemI2CAddresses) {
			char buf[10];
            hexToString(value, buf);
            systemI2CAddressesJsonArray.add(buf);
        }

        JsonArray deviceTypes = doc["deviceTypes"].to<JsonArray>();
        JsonObject defaultDevice = deviceTypes.add<JsonObject>();
    #if MOTOR_TYPE == 0
        defaultDevice["name"] = "OSR";
        defaultDevice["value"] = DeviceType::OSR;
        JsonObject SR6 = deviceTypes.add<JsonObject>();
        SR6["name"] = "SR6";
        SR6["value"] = DeviceType::SR6;
        JsonObject TVIBE = deviceTypes.add<JsonObject>();
        TVIBE["name"] = "TVIBE";
        TVIBE["value"] = DeviceType::TVIBE;
    #elif MOTOR_TYPE == 1
        defaultDevice["name"] = "SSR1";
        defaultDevice["value"] = DeviceType::SSR1;
        JsonArray encoderTypes = doc["encoderTypes"].to<JsonArray>();
        JsonObject defaultEncoder = encoderTypes.add<JsonObject>();
        defaultEncoder["name"] = "MT6701 SSI";
        defaultEncoder["value"] = BLDCEncoderType::MT6701;
        JsonObject PWM = encoderTypes.add<JsonObject>();
        PWM["name"] = "PWM";
        PWM["value"] = BLDCEncoderType::PWM;
        JsonObject SPI = encoderTypes.add<JsonObject>();
        SPI["name"] = "SPI";
        SPI["value"] = BLDCEncoderType::SPI;
    #endif

        JsonArray bleDeviceTypes = doc["bleDeviceTypes"].to<JsonArray>();
        JsonObject defaultBleDevice = bleDeviceTypes.add<JsonObject>();
        defaultBleDevice["name"] = "TCode";
        defaultBleDevice["value"] = BLEDeviceType::TCODE;
        JsonObject loveDevice = bleDeviceTypes.add<JsonObject>();
        loveDevice["name"] = "Love";
        loveDevice["value"] = BLEDeviceType::LOVE;
        JsonObject hcDevice = bleDeviceTypes.add<JsonObject>();
        // HC has an unknown formatting.
        hcDevice["name"] = "HC";
        hcDevice["value"] = BLEDeviceType::HC;

        JsonArray bleLoveDevices = doc["bleLoveDeviceTypes"].to<JsonArray>();
        JsonObject defaultLoveDevice = bleLoveDevices.add<JsonObject>();
        defaultLoveDevice["name"] = "Edge";
        defaultLoveDevice["value"] = BLELoveDeviceType::EDGE;
        

        JsonArray availableChannels = doc["availableChannels"].to<JsonArray>();
        channelMap.serialize(availableChannels);
        doc[MOTION_ENABLED] = getMotionEnabled();
        // int motionProfileSelectedIndex = MOTION_PROFILE_SELECTED_INDEX_DEFAULT;
        // m_settingsFactory->getValue(MOTION_PROFILE_SELECTED_INDEX, motionProfileSelectedIndex);
        doc[MOTION_PROFILE_SELECTED_INDEX] = motionSelectedProfileIndex; 

        JsonArray availableTimers = doc["availableTimers"].to<JsonArray>();
        JsonArray timerChannels = doc["timerChannels"].to<JsonArray>();
        JsonObject timerChannelNoneObj = timerChannels.add<JsonObject>();
        timerChannelNoneObj["name"] = "None";
        timerChannelNoneObj["value"] = ESPTimerChannelNum::NONE;
        PinMap* pinMap = m_settingsFactory->getPins();
        for (size_t i = 0; i < MAX_TIMERS; i++)
        {
            JsonObject timerObj = availableTimers.add<JsonObject>();
            ESPTimer* timer = pinMap->getTimer(i);
            timerObj["id"] = timer->id;
            timerObj["name"] = timer->name;
            timerObj["value"] = i;
            for (size_t j = 0; j < 2; j++)
            {
                JsonObject timerChannelObj = timerChannels.add<JsonObject>();
                timerChannelObj["name"] = timer->channels[j].name;
                timerChannelObj["value"] = timer->channels[j].channel;
            }
        }

        doc["localIP"] = currentIP;
        doc["gateway"] = currentGateway;
        doc["subnet"] = currentSubnet;
        doc["dns1"] = currentDns1;
        doc["dns2"] = currentDns2;// Not being used currently
        char macTemp[18] = {0};
		#ifdef ESP_ARDUINO3
        strlcpy(macTemp, Network.macAddress().c_str(), sizeof(macTemp));
		#else
        strlcpy(macTemp, WiFi.macAddress().c_str(), sizeof(macTemp));
		#endif
		doc["mac"] = macTemp;

        doc["chipModel"] = ESP.getChipModel();
        doc["chipRevision"] = ESP.getChipRevision();
        doc["chipCores"] = ESP.getChipCores();
        uint32_t chipId = 0;
        for (int i = 0; i < 17; i = i + 8)
        {
            chipId |= ((ESP.getEfuseMac() >> (40 - i)) & 0xff) << i;
        }
        doc["chipID"] = chipId;

