jcfain/TCodeESP32/ESP32/src/SettingsHandler.h
        doc["decoyPass"] = DECOY_PASS;
        doc["apMode"] = apMode;
        doc["defaultIP"] = DEFAULT_IP;
        //String output;
        serializeJson(doc, buf);
        doc.clear();
        if (LogHandler::getLogLevel() == LogLevel::VERBOSE)
            Serial.printf("SystemInfo: %s\n", buf.c_str());
        // buf[0] = {0};
        // strcpy(buf, output.c_str());
    }

    static bool loadButtons(bool loadDefault, JsonObject json = JsonObject()) {
        LogHandler::info(_TAG, "Loading buttons");
        return loadSettingsJson(BUTTON_SETTINGS_PATH, loadDefault, m_buttonsMutex, [](const JsonObject json, bool& mutableLoadDefault) -> bool {
            
            // const bool bootButtonEnabled = SettingsHandler::getValue<const bool>(BOOT_BUTTON_ENABLED);
            // const bool buttonSetsEnabled = SettingsHandler::getValue<const bool>(BUTTON_SETS_ENABLED);;
            // const char* bootButtonCommand =  SettingsHandler::getValue<const char*>(BOOT_BUTTON_COMMAND);;
            // const int buttonAnalogDebounce = SettingsHandler::getValue<const int>(BUTTON_ANALOG_DEBOUNCE);
            // setValue(json, bootButtonEnabled, "buttonCommand", "bootButtonEnabled", BOOT_BUTTON_ENABLED_DEFAULT);
            // setValue(json, buttonSetsEnabled, "buttonCommand", "buttonSetsEnabled", BOOT_BUTTON_COMMAND_DEFAULT);
            // setValue(json, bootButtonCommand, "buttonCommand", "bootButtonCommand", BUTTON_SETS_ENABLED_DEFAULT);
            // setValue(json, buttonAnalogDebounce, "buttonCommand", "buttonAnalogDebounce", BUTTON_ANALOG_DEBOUNCE_DEFAULT);
            if(!json.isNull())
            {
                bool bootButtonEnabled = json[BOOT_BUTTON_ENABLED] | BOOT_BUTTON_ENABLED_DEFAULT;
                m_settingsFactory->setValue(BOOT_BUTTON_ENABLED, bootButtonEnabled);
                bool buttonSetsEnabled = json[BUTTON_SETS_ENABLED] | BUTTON_SETS_ENABLED_DEFAULT;
                m_settingsFactory->setValue(BUTTON_SETS_ENABLED, buttonSetsEnabled);
                const char* bootButtonCommand = json[BOOT_BUTTON_COMMAND] | BOOT_BUTTON_COMMAND_DEFAULT;
                m_settingsFactory->setValue(BOOT_BUTTON_COMMAND, bootButtonCommand);
                int buttonAnalogDebounce = json[BUTTON_ANALOG_DEBOUNCE] | BUTTON_ANALOG_DEBOUNCE_DEFAULT;
                m_settingsFactory->setValue(BUTTON_ANALOG_DEBOUNCE, buttonAnalogDebounce);
                m_settingsFactory->saveCommon();
            }

            JsonArray buttonSetsObj = json["buttonSets"].as<JsonArray>();
            if(buttonSetsObj.isNull()) {
                LogHandler::info(_TAG, "No button sets stored, loading default");
                mutableLoadDefault = true;
                
                const PinMap* pinMap = m_settingsFactory->getPins();
                for(int i = 0; i < MAX_BUTTON_SETS; i++) {
                    buttonSets[i] = ButtonSet();
                    buttonSets[i].pin = pinMap->buttonSetPin(i);
                        
                    sprintf(buttonSets[i].name, "Button set %u", i+1);
                    LogHandler::debug(_TAG, "Default buttonset name: %s, index: %u, pin: %ld", buttonSets[i].name, i, buttonSets[i].pin);
                    for(int j = 0; j < MAX_BUTTONS; j++) {
                        buttonSets[i].buttons[j] = ButtonModel();
                        buttonSets[i].buttons[j].loadDefault(j);
                        LogHandler::debug(_TAG, "Default button name: %s, index: %u, command: %s", buttonSets[i].name, buttonSets[i].buttons[j].index, buttonSets[i].buttons[j].command);

                    }
                }
            } else {
                std::vector<int> pins; 
                for(int i = 0; i < MAX_BUTTON_SETS; i++) {
                    auto set = ButtonSet();
                    set.fromJson(buttonSetsObj[i].as<JsonObject>());
                    pins.push_back(set.pin);
                    LogHandler::debug(_TAG, "Loaded button set '%s', pin: %ld", set.name, set.pin);
                    buttonSets[i] = set;
                    for(int j = 0; j < MAX_BUTTONS; j++) {
                        LogHandler::debug(_TAG, "Loaded button, name: %s, index: %u, command: %s", buttonSets[i].name, buttonSets[i].buttons[j].index, buttonSets[i].buttons[j].command);
                    }
                }
                m_settingsFactory->setValue(BUTTON_SET_PINS, pins);
                m_settingsFactory->savePins();
            }
            
            if(initialized)
                sendMessage(SettingProfile::Button, "analogButtonCommands");
            
            return true;
        }, saveButtons, json);
    }

    static bool saveButtons(JsonObject json = JsonObject()) {
        LogHandler::info(_TAG, "Save buttons file");
        uint16_t docSize = 2000;
        // for(int i = 0; i < MAX_BUTTON_SETS; i++) {
        //     LogHandler::debug(_TAG, "Save buttonSets[i] '%s', pin: %ld",  buttonSets[i].name, buttonSets[i].pin);
        //     for(int j = 0; j < MAX_BUTTONS; j++) {
        //         LogHandler::debug(_TAG, "Save buttonSets[i].buttons, name: %s,  index: %ld, command: %s", buttonSets[i].name, buttonSets[i].buttons[j].index, buttonSets[i].buttons[j].command);
        //     }
        // }
        return saveSettingsJson(BUTTON_SETTINGS_PATH, m_buttonsMutex, docSize, [](JsonDocument& doc) -> bool {

            bool bootButtonEnabled = BOOT_BUTTON_ENABLED_DEFAULT;
            m_settingsFactory->getValue(BOOT_BUTTON_ENABLED, bootButtonEnabled);
            doc[BOOT_BUTTON_ENABLED] = bootButtonEnabled; 
            bool buttonSetsEnabled = BUTTON_SETS_ENABLED_DEFAULT;
            m_settingsFactory->getValue(BUTTON_SETS_ENABLED, buttonSetsEnabled);
            doc[BUTTON_SETS_ENABLED] = buttonSetsEnabled;
            // char bootButtonCommand[BOOT_BUTTON_COMMAND_LEN] = {0};
            // m_settingsFactory->getValue(BOOT_BUTTON_COMMAND, bootButtonCommand, BOOT_BUTTON_COMMAND_LEN);
            const char* bootButtonCommand = m_settingsFactory->getBootButtonCommand();
            doc[BOOT_BUTTON_COMMAND] = bootButtonCommand; 
            int buttonAnalogDebounce = BUTTON_ANALOG_DEBOUNCE_DEFAULT;
            m_settingsFactory->getValue(BUTTON_ANALOG_DEBOUNCE, buttonAnalogDebounce);
            doc[BUTTON_ANALOG_DEBOUNCE] = buttonAnalogDebounce;

