jcfain/TCodeESP32/ESP32/src/SettingsHandler.h
				char buf[10];
				hexToString(address, buf);
				LogHandler::info(_TAG, "I2C device found at address %s, byte %ld", buf, address);

				systemI2CAddresses.push_back((int)address);
				nDevices++;
			}
			else if (error==4) 
			{
				Serial.print("Unknow error at address 0x");
				if (address<16) 
				{
					Serial.print("0");
				}
				Serial.println(address,HEX);
                // std::stringstream I2C_Address_String;
                // I2C_Address_String << "0x" << std::hex << address;
                // std::string foundAddress = I2C_Address_String.str();
				// LogHandler::error(_TAG, "Unknow error at address %s", foundAddress);
			}    
		}
		if (nDevices == 0) {
			LogHandler::info(_TAG, "No I2C devices found");
			return false;
		}
		return true;
	}
    
    static u_int16_t getChannelMin(const char *channel) 
    {
        for (size_t i = 0; i < currentChannels.size(); i++)
        {
            if(strcmp(currentChannels[i].Name, channel) == 0)
                return currentChannels[i].min;
        }
        return 1;
    }

    static u_int16_t getChannelMax(const char *channel) 
    {
        for (size_t i = 0; i < currentChannels.size(); i++) {
            if(strcmp(currentChannels[i].Name, channel) == 0)
                return currentChannels[i].max;
        }
        return 9999;
    }

    static void setChannelMin(const char *channel, u_int16_t value) 
    {
        for (size_t i = 0; i < currentChannels.size(); i++) {
            if(strcmp(currentChannels[i].Name, channel) == 0) {
                currentChannels[i].min = value;
                return;
            }
        }
    }

    static void setChannelMax(const char *channel, u_int16_t value) 
    {
        for (size_t i = 0; i < currentChannels.size(); i++) {
            if(strcmp(currentChannels[i].Name, channel) == 0) {
                currentChannels[i].max = value;
                return;
            }
        }
    }

private:
    static const char *_TAG;
    
    static SettingsFactory* m_settingsFactory;
	static SemaphoreHandle_t m_motionMutex;
	static SemaphoreHandle_t m_wifiMutex;
    static SemaphoreHandle_t m_buttonsMutex;
	static SemaphoreHandle_t m_settingsMutex;
    static SETTING_STATE_FUNCTION_PTR_T message_callback;
    // Use http://arduinojson.org/assistant to compute the capacity.
    // static const size_t readCapacity = JSON_OBJECT_SIZE(100) + 2000;
    // static const size_t saveCapacity = JSON_OBJECT_SIZE(100);
    static const int deserializeSize = 32768;
    static const int serializeSize = 24576;
    // 3072

    static bool motionEnabled;
    static int motionSelectedProfileIndex;
    static int motionDefaultProfileIndex;
    static MotionProfile motionProfiles[maxMotionProfileCount];
    
    // static bool voiceEnabled;
    // static bool voiceMuted;
    // static int voiceWakeTime ;
    // static int voiceVolume;

//     static bool update(JsonObject json)
//     {
//         logLevel = (LogLevel)(json["logLevel"] | 2);
//         LogHandler::setLogLevel(logLevel);
//         LogHandler::debug(_TAG, "Load Json: Memory usage: %u bytes", json.memoryUsage());

//         boardType = (BoardType)(json["boardType"] | (uint8_t)BoardType::DEVKIT);

//         if(isBoardType(BoardType::CRIMZZON) || isBoardType(BoardType::ISAAC)) {
//             TCodeVersionEnum = TCodeVersion::v0_3;
//             TCodeVersionName = TCodeVersionMapper(TCodeVersionEnum);
//         }
        // std::vector<String> includesVec;
        // setValue(json, includesVec, "log", "log-include-tags");
        // LogHandler::setIncludes(includesVec);

        // std::vector<String> excludesVec;
        // setValue(json, excludesVec, "log", "log-exclude-tags");
        // LogHandler::setExcludes(excludesVec);

//         if(!isBoardType(BoardType::CRIMZZON)) {
//             TCodeVersionEnum = (TCodeVersion)(json["TCodeVersion"] | 1);
//             TCodeVersionName = TCodeVersionMapper(TCodeVersionEnum);
//         }

//         channelMap.init(TCodeVersionEnum, motorType);

// #if MOTOR_TYPE == 1
//         for (auto x : ChannelMapBLDC) {
//             currentChannels.push_back(x);
//         }
// #else
//         currentChannels.clear();
//         if(TCodeVersionEnum == TCodeVersion::v0_2) {
//             // for (size_t i = 0; i < (sizeof(ChannelMapV2)/sizeof(Channel)); i++) {
//             //     currentChannels.push_back(ChannelMapV2[i]);
//             // }
//             for (auto x : ChannelMapV2) {
//                 currentChannels.push_back(x);
//             }
//         } else {
//             for (auto x : ChannelMapV3) {
//                 currentChannels.push_back(x);
//             }
//         }  
// #endif


//         int tcodeMax = TCodeVersionEnum == TCodeVersion::v0_2 ? 999 : 9999;
//         for (size_t i = 0; i < currentChannels.size(); i++)
//         {
//             uint16_t min = json["channelRanges"][currentChannels[i].Name]["min"].as<uint16_t>();
//             uint16_t max = json["channelRanges"][currentChannels[i].Name]["max"].as<uint16_t>();
//             currentChannels[i].min = !min ? 1 : min;
//             currentChannels[i].max = !max ? tcodeMax : max;
//         }
        
//         sendMessage("channelRanges", "channelRanges");// TODO: channelranges should be in its own json

//         udpServerPort = json["udpServerPort"] | 8000;
//         webServerPort = json["webServerPort"] | 80;
//         const char *hostnameTemp = json["hostname"] | "tcode";
//         if (hostnameTemp != nullptr)
//             strcpy(hostname, hostnameTemp);
//         const char *friendlyNameTemp = json["friendlyName"] | "ESP32 TCode";
//         if (friendlyNameTemp != nullptr)
//             strcpy(friendlyName, friendlyNameTemp);

//         bluetoothEnabled = json["bluetoothEnabled"] | false;

//         // Servo motors//////////////////////////////////////////////////////////////////////////////////
//         pitchFrequencyIsDifferent = json["pitchFrequencyIsDifferent"];
//         msPerRad = json["msPerRad"] | 637;
//         servoFrequency = json["servoFrequency"] | 50;
//         pitchFrequency = json[pitchFrequencyIsDifferent ? "pitchFrequency" : "servoFrequency"] | servoFrequency;
//         sr6Mode = json["sr6Mode"];

//         RightServo_ZERO = json["RightServo_ZERO"] | 1500;
//         LeftServo_ZERO = json["LeftServo_ZERO"] | 1500;
//         RightUpperServo_ZERO = json["RightUpperServo_ZERO"] | 1500;
//         LeftUpperServo_ZERO = json["LeftUpperServo_ZERO"] | 1500;
//         PitchLeftServo_ZERO = json["PitchLeftServo_ZERO"] | 1500;
//         PitchRightServo_ZERO = json["PitchRightServo_ZERO"] | 1500;

//         BLDC_UsePWM = json["BLDC_UsePWM"] | false; // Must be before pinout is set
//         BLDC_UseMT6701 = json["BLDC_UseMT6701"] | true;
//         BLDC_UseHallSensor = json["BLDC_UseHallSensor"] | false;
//         BLDC_Pulley_Circumference = json["BLDC_Pulley_Circumference"] | 60;
//         BLDC_MotorA_Voltage = round2(json["BLDC_MotorA_Voltage"] | 20.0);
//         BLDC_MotorA_Current = round2(json["BLDC_MotorA_Current"] | 1.0);
//         BLDC_MotorA_ParametersKnown = json["BLDC_MotorA_ParametersKnown"] | false;
//         BLDC_MotorA_ZeroElecAngle = round2(json["BLDC_MotorA_ZeroElecAngle"] | 0.00);
//         BLDC_RailLength = json["BLDC_RailLength"] | 125;
//         BLDC_StrokeLength = json["BLDC_StrokeLength"] | 120;

//         setBoardPinout(json);
        
