jcfain/TCodeESP32/ESP32/src/SettingsHandler.h
//         if(isBoardType(BoardType::CRIMZZON)) {
//             heaterResolution = json["heaterResolution"] | 8;
//             caseFanResolution = json["caseFanResolution"] | 10;
//             caseFanFrequency = json["caseFanFrequency"] | 25;
//             Display_Screen_Height = json["Display_Screen_Height"] | 32;
//         }

//         twistFrequency = json["twistFrequency"] | 50;
//         squeezeFrequency = json["squeezeFrequency"] | 50;
//         valveFrequency = json["valveFrequency"] | 50;
//         continuousTwist = json["continuousTwist"];
//         feedbackTwist = json["feedbackTwist"];
//         analogTwist = json["analogTwist"];
//         TwistServo_ZERO = json["TwistServo_ZERO"] | 1500;
//         ValveServo_ZERO = json["ValveServo_ZERO"] | 1500;
//         SqueezeServo_ZERO = json["Squeeze_ZERO"] | 1500;

//         staticIP = json["staticIP"];
//         const char *localIPTemp = json["localIP"] | "192.168.0.150";
//         if (localIPTemp != nullptr)
//             strcpy(localIP, localIPTemp);
//         const char *gatewayTemp = json["gateway"] | "192.168.0.1";
//         if (gatewayTemp != nullptr)
//             strcpy(gateway, gatewayTemp);
//         const char *subnetTemp = json["subnet"] | "255.255.255.0";
//         if (subnetTemp != nullptr)
//             strcpy(subnet, subnetTemp);
//         const char *dns1Temp = json["dns1"] | "8.8.8.8";
//         if (dns1Temp != nullptr)
//             strcpy(dns1, dns1Temp);
//         const char *dns2Temp = json["dns2"] | "8.8.4.4";
//         if (dns2Temp != nullptr)
//             strcpy(dns2, dns2Temp);

//         autoValve = json["autoValve"];
//         inverseValve = json["inverseValve"];
//         valveServo90Degrees = json["valveServo90Degrees"];
//         inverseStroke = json["inverseStroke"];
//         inversePitch = json["inversePitch"];
//         lubeEnabled = json["lubeEnabled"];
//         lubeAmount = json["lubeAmount"] | 255;
//         displayEnabled = json["displayEnabled"] | true;
//         sleeveTempDisplayed = json["sleeveTempDisplayed"];
//         internalTempDisplayed = json["internalTempDisplayed"];
//         versionDisplayed = json["versionDisplayed"] | true;
//         Display_Screen_Width = json["Display_Screen_Width"] | 128;
//         if(!isBoardType(BoardType::CRIMZZON)) {
//             Display_Screen_Height = json["Display_Screen_Height"] | 64;
//         }
//         const char *Display_I2C_AddressTemp = json["Display_I2C_Address"] | "0x3c";
//         if (Display_I2C_AddressTemp != nullptr)
//             Display_I2C_Address = (int)strtol(Display_I2C_AddressTemp, NULL, 0);
//         Display_Rst_PIN = json["Display_Rst_PIN"] | -1;

//         tempSleeveEnabled = json["tempSleeveEnabled"];
//         heaterThreshold = json["heaterThreshold"] | 5.0;
//         heaterFrequency = json["heaterFrequency"] | 50;
//         if(!isBoardType(BoardType::CRIMZZON)) {
//             heaterResolution = json["heaterResolution"] | 8;
//         }
//         TargetTemp = json["TargetTemp"] | 40.0;
//         HeatPWM = json["HeatPWM"] | 255;
//         HoldPWM = json["HoldPWM"] | 110;

//         tempInternalEnabled = json["tempInternalEnabled"];
//         fanControlEnabled = json["fanControlEnabled"];
//         internalTempForFan = json["internalTempForFan"] | 30.0;
//         internalMaxTemp = json["internalMaxTemp"] | 50.0;

//         batteryLevelEnabled = json["batteryLevelEnabled"];
//         batteryLevelNumeric = json["batteryLevelNumeric"];
//         batteryVoltageMax = json["batteryVoltageMax"] | 12.6;
//         batteryCapacityMax = json["batteryCapacityMax"] | 3500;

//         if(!isBoardType(BoardType::CRIMZZON)) {
//             caseFanFrequency = json["caseFanFrequency"] | 25;
//             caseFanResolution = json["caseFanResolution"] | 10;
//         }
//         caseFanMaxDuty = pow(2, caseFanResolution) - 1;
        
//         lubeEnabled = json["lubeEnabled"];

//         setValue(json, voiceEnabled, "voiceHandler", "voiceEnabled", false);
//         setValue(json, voiceMuted, "voiceHandler", "voiceMuted", false);
//         setValue(json, voiceVolume, "voiceHandler", "voiceVolume", 0);
//         setValue(json, voiceWakeTime, "voiceHandler", "voiceWakeTime", 10);

//         lastRebootReason = machine_reset_cause();
//         LogHandler::debug(_TAG, "Last reset reason: %s", SettingsHandler::lastRebootReason);

//         LogUpdateDebug();
//         return true;
//     }

//     static bool compileCommonJsonDocument(DynamicJsonDocument& doc)
//     {
//         // LogHandler::info(_TAG, "Save settings");
//         // Delete existing file, otherwise the configuration is appended to the file
//         // Serial.print("LittleFS used: ");
//         // Serial.println(LittleFS.usedBytes() + "/" + LittleFS.totalBytes());
//         // if (!LittleFS.remove(userSettingsFilePath))
//         // {
//         //     LogHandler::error(_TAG, "Failed to remove settings file: %s", userSettingsFilePath);
//         // }
//         // File file = LittleFS.open(userSettingsFilePath, FILE_WRITE);
//         // if (!file)
//         // {
//         //     LogHandler::error(_TAG, "Failed to create settings file: %s", userSettingsFilePath);
//         //     return false;
//         // }

//         // // Allocate a temporary docdocument
//         // DynamicdocDocument doc(serializeSize);

//         doc["boardType"] = (uint8_t)boardType;
//         doc["logLevel"] = (int)logLevel;
//         LogHandler::setLogLevel(logLevel);
//         // Serial.println("logLevel: ");
//         // Serial.println((int)logLevel);
//         // Serial.println( doc["logLevel"] .as<int>());
//         // Serial.println((int)doc["logLevel"]);

//         // std::vector<const char*> tags;
//         //  tags.push_back(TagHandler::DisplayHandler);
//         //  tags.push_back(TagHandler::BLDCHandler);
//         //  tags.push_back(TagHandler::ServoHandler3);
//         // LogHandler::setTags(tags);
        
//         for (size_t i = 0; i < currentChannels.size(); i++)
//         {
//             doc["channelRanges"][currentChannels[i].Name]["min"] = currentChannels[i].min;
//             doc["channelRanges"][currentChannels[i].Name]["max"] = currentChannels[i].max;
//             // LogHandler::debug(_TAG, "save %s min: %i", currentChannels[i].Name, doc["channelRanges"][currentChannels[i].Name]["min"].as<int>());
//             // LogHandler::debug(_TAG, "save %s max: %i", currentChannels[i].Name, doc["channelRanges"][currentChannels[i].Name]["max"].as<int>());
//         }

