jcfain/TCodeESP32/ESP32/src/SettingsHandler.h
    static void sendMessage(const SettingProfile &profile, const char *message)
    {
        if (message_callback)
        {
            LogHandler::debug(_TAG, "sendMessage: message_callback %s", message);
            message_callback(profile, message);
        }
        else
        {
            LogHandler::debug(_TAG, "sendMessage: message_callback 0");
        }
    }

    static void setValue(JsonObject json, bool &variable, const SettingProfile &profile, const char *propertyName, bool defaultValue)
    {
        bool newValue = json[propertyName] | defaultValue;
        setValue(newValue, variable, profile, propertyName);
    }

    template<size_t n> 
    static void setValue(JsonObject json, char (&variable)[n], const SettingProfile &profile, const char *propertyName, const char *defaultValue)
    {
        const char *newValue = json[propertyName] | defaultValue;
        setValue(newValue, variable, profile, propertyName);
    }

    static void setValue(JsonObject json, int &variable, const SettingProfile &profile, const char *propertyName, int defaultValue)
    {
        int newValue = json[propertyName] | defaultValue;
        setValue(newValue, variable, profile, propertyName);
    }
    static void setValue(JsonObject json, uint8_t &variable, const SettingProfile &profile, const char *propertyName, uint8_t defaultValue)
    {
        uint8_t newValue = json[propertyName] | defaultValue;
        setValue(newValue, variable, profile, propertyName);
    }
    static void setValue(JsonObject json, uint16_t &variable, const SettingProfile &profile, const char *propertyName, uint16_t defaultValue)
    {
        uint16_t newValue = json[propertyName] | defaultValue;
        setValue(newValue, variable, profile, propertyName);
    }

    static void setValue(JsonObject json, float &variable, const SettingProfile &profile, const char *propertyName, float defaultValue)
    {
        float newValue = json[propertyName] | defaultValue;
        setValue(newValue, variable, profile, propertyName);
    }

    static void setValue(JsonObject json, std::vector<const char*> &variable, const SettingProfile &profile, const char *propertyName)
    {
        variable.clear();
        if(json[propertyName].isNull()) {
            return;
        }
        JsonArray jsonArray = json[propertyName].as<JsonArray>();
        for (int i = 0; i < jsonArray.size(); i++)
        {
            variable.push_back(jsonArray[i]);
        }
        if(initialized)
            sendMessage(profile, propertyName);
    }

    static void setValue(JsonObject json, std::vector<String> &variable, const SettingProfile &profile, const char *propertyName)
    {
        variable.clear();
        if(json[propertyName].isNull()) {
            return;
        }
        JsonArray jsonArray = json[propertyName].as<JsonArray>();
        for (int i = 0; i < jsonArray.size(); i++)
        {
            variable.push_back(jsonArray[i]);
        }
        if(initialized)
            sendMessage(profile, propertyName);
    }

    static void setValue(bool newValue, bool &variable, const SettingProfile &profile, const char *propertyName)
    {
        bool valueChanged = initialized && variable != newValue;
        LogHandler::debug(TagHandler::SettingsHandler, "Set bool '%s' oldValue '%ld' newValue '%ld' changed: '%ld'", propertyName, variable, newValue, valueChanged);
        variable = newValue;
        if (valueChanged)
            sendMessage(profile, propertyName);
    }
    
    template<size_t n> 
    static void setValue(const char *newValue, char (&variable)[n], const SettingProfile &profile, const char *propertyName)
    {
        bool valueChanged = initialized && strcmp(variable, newValue) != -1;
        LogHandler::debug(TagHandler::SettingsHandler, "Set char* '%s' oldValue '%s' newValue '%s' changed: '%ld'", propertyName, variable, newValue, valueChanged);
        strcpy(variable, newValue);
        if (valueChanged)
            sendMessage(profile, propertyName);
    }

    static void setValue(int newValue, int &variable, const SettingProfile &profile, const char *propertyName)
    {
        bool valueChanged = initialized && variable != newValue;
        LogHandler::debug(TagHandler::SettingsHandler, "Set int '%s' oldValue '%ld' newValue '%ld' changed: '%ld'", propertyName, variable, newValue, valueChanged);
        variable = newValue;
        if (valueChanged)
            sendMessage(profile, propertyName);
    }

    static void setValue(uint8_t newValue, uint8_t &variable, const SettingProfile &profile, const char *propertyName)
    {
        bool valueChanged = initialized && variable != newValue;
        LogHandler::debug(TagHandler::SettingsHandler, "Set int '%s' oldValue '%u' newValue '%u' changed: '%ld'", propertyName, variable, newValue, valueChanged);
        variable = newValue;
        if (valueChanged)
            sendMessage(profile, propertyName);
    }

    static void setValue(uint16_t newValue, uint16_t &variable, const SettingProfile &profile, const char *propertyName)
    {
        bool valueChanged = initialized && variable != newValue;
        LogHandler::debug(TagHandler::SettingsHandler, "Set int '%s' oldValue '%u' newValue '%u' changed: '%ld'", propertyName, variable, newValue, valueChanged);
        variable = newValue;
        if (valueChanged)
            sendMessage(profile, propertyName);
    }

    static void setValue(float newValue, float &variable, const SettingProfile &profile, const char *propertyName)
    {
        bool valueChanged = initialized && variable != newValue;
        LogHandler::debug(TagHandler::SettingsHandler, "Set float '%s' oldValue '%f' newValue '%f' changed: '%ld'", propertyName, variable, newValue, valueChanged);
        variable = newValue;
        if (valueChanged)
            sendMessage(profile, propertyName);
    }

    static u_int16_t calculateRange(const char *channel, int value)
    {
        return constrain(value, getChannelMin(channel), getChannelMax(channel));
    }

    // Function that gets current epoch time
    static unsigned long getTime()
    {
        time_t now;
        struct tm timeinfo;
        if (!getLocalTime(&timeinfo))
        {
            // Serial.println("Failed to obtain time");
            return (0);
        }
        time(&now);
        return now;
    }

    static const char *machine_reset_cause()
    {
        switch (esp_reset_reason())
        {
        case ESP_RST_POWERON:
            return "Reset due to power-on event";
            break;
        case ESP_RST_BROWNOUT:
            return "Brownout reset (software or hardware)";
            break;
        case ESP_RST_INT_WDT:
            return "Reset (software or hardware) due to interrupt watchdog";
            break;
        case ESP_RST_TASK_WDT:
            return "Reset due to task watchdog";
            break;
        case ESP_RST_WDT:
            return "Reset due to other watchdogs";
            break;
        case ESP_RST_DEEPSLEEP:
            return "Reset after exiting deep sleep mode";
            break;
        case ESP_RST_SW:
            return "Software reset via esp_restart";
            break;
        case ESP_RST_PANIC:
            return "Software reset due to exception/panic";
            break;
        case ESP_RST_EXT: // Comment in ESP-IDF: "For ESP32, ESP_RST_EXT is never returned"
            return "Reset by external pin (not applicable for ESP32)";
            break;
        case ESP_RST_SDIO:
            return "Reset over SDIO";
            break;
        case ESP_RST_UNKNOWN:
            return "Reset reason can not be determined";
            break;
        default:
            return "";
            break;
        }
    }

    // static bool LogDeserializationError(DeserializationError error, const char* filename) {
    //     if (error)
    //     {
    //         LogHandler::error(_TAG, "Error deserializing json: %s", filename);
    //         switch (error.code())
    //         {
    //         case DeserializationError::Code::Ok:
    //             LogHandler::error(_TAG, "Code: Ok");
    //             break;
    //         case DeserializationError::Code::EmptyInput:
    //             LogHandler::error(_TAG, "Code: EmptyInput");
    //             break;
    //         case DeserializationError::Code::IncompleteInput:
    //             LogHandler::error(_TAG, "Code: IncompleteInput");
    //             break;
    //         case DeserializationError::Code::InvalidInput:
    //             LogHandler::error(_TAG, "Code: InvalidInput");
    //             break;
    //         case DeserializationError::Code::NoMemory:
    //             LogHandler::error(_TAG, "Code: NoMemory");
    //             break;
    //         case DeserializationError::Code::TooDeep:
    //             LogHandler::error(_TAG, "Code: TooDeep");
    //             break;
    //         }
    //         return true;
    //     }
    //     return false;
    // }

